{"classes":["TEAM","PLAYER","PREDICTION"],"annotations":[["Portugal vs. France. You have the defending World Cup champions, France, taking on the defending European champions, Portugal. These are two of the most talented teams in the world, they have serious attacking firepower, and they join Germany in the tournament’s “group of death.” They’ll meet in the final group-stage match, and chances are both will need a result to improve their chances at reaching the knockout stage.",{"entities":[[0,8,"TEAM"],[13,20,"TEAM"],[34,43,"PREDICTION"],[54,63,"PREDICTION"],[65,71,"TEAM"],[97,115,"PREDICTION"],[117,126,"TEAM"],[148,161,"PREDICTION"],[200,219,"PREDICTION"],[235,242,"TEAM"],[263,280,"PREDICTION"],[301,306,"PREDICTION"],[369,390,"PREDICTION"]]}],["I’m a sucker for a good England vs Scotland game, so I’m excited for that, but I’m most intrigued by France vs Germany. I need a vibe check on Germany, who have one of the deepest squads in the world but have been in the wilderness for a few years. Going against France early will probably spell out where they are quite clearly.",{"entities":[[19,23,"PREDICTION"],[24,31,"TEAM"],[35,43,"TEAM"],[83,97,"PREDICTION"],[101,107,"TEAM"],[111,119,"TEAM"],[129,139,"PREDICTION"],[143,150,"TEAM"],[172,186,"PREDICTION"],[221,231,"PREDICTION"],[263,269,"TEAM"],[290,299,"PREDICTION"]]}],["Portugal vs. France. A healthy Cristiano Ronaldo, João Félix, N’Golo Kanté, Karim Benzema, and Kylian Mbappé could make this even more fun than when these teams met in the 2016 final.",{"entities":[[0,8,"TEAM"],[13,20,"TEAM"],[31,48,"PLAYER"],[50,60,"PLAYER"],[62,74,"PLAYER"],[76,89,"PLAYER"],[95,108,"PLAYER"],[130,138,"PREDICTION"]]}],["Give me N’Golo Kanté. Playing with Kanté is like playing with 12 guys out there. He might be the most uniquely valuable player in the world and covers up so many problems. I’d argue he’s more valuable to France than Mbappé (who’d be my second pick) and he doesn’t need service to impact a game like Cristiano Ronaldo or Robert Lewandowski. Give me Kanté and I’ll add attacking players later in this hypothetical fantasy draft.",{"entities":[[8,21,"PLAYER"],[35,40,"PLAYER"],[97,110,"PREDICTION"],[111,119,"PREDICTION"],[187,200,"PREDICTION"],[204,210,"TEAM"],[216,222,"PLAYER"],[236,247,"PREDICTION"],[280,293,"PREDICTION"],[299,316,"PLAYER"],[320,339,"PLAYER"],[348,353,"PLAYER"],[367,384,"PREDICTION"]]}],["Harry Kane, England. The only other thing as critical as scoring goals is making them, and Kane led the league this past season in both, nabbing the Premier League’s Golden Boot and Playmaker Award with 23 goals and 14 assists.",{"entities":[[0,10,"PLAYER"],[12,20,"TEAM"],[45,53,"PREDICTION"],[57,70,"PREDICTION"],[91,95,"PLAYER"],[96,99,"PREDICTION"],[166,177,"PREDICTION"],[182,197,"PREDICTION"],[203,211,"PREDICTION"],[216,226,"PREDICTION"]]}],["Denmark is good, Really solid midfield with one elite string-puller in Christian Eriksen. Three home games in an easy group—if they don’t get at least four points off Finland and Russia I’d be shocked—and a draw that lets them avoid a group winner even if they finish second in Group B",{"entities":[[0,7,"TEAM"],[11,15,"PREDICTION"],[24,38,"PREDICTION"],[48,53,"PREDICTION"],[71,89,"PLAYER"],[113,117,"PREDICTION"],[167,174,"TEAM"],[179,185,"TEAM"],[193,204,"PREDICTION"],[241,247,"PREDICTION"]]}],["If I had to pick a sleeper to make a little run, it’s Denmark, a team with some really interesting talent: Christian Eriksen, Kasper Schmeichel, Andreas Christensen, and Pierre-Emile Hojbjerg, among many others. I like teams without many holes and with a lot of depth, and Denmark has that.",{"entities":[[54,61,"TEAM"],[80,105,"PREDICTION"],[107,124,"PLAYER"],[126,143,"PLAYER"],[145,164,"PLAYER"],[170,191,"PLAYER"],[214,218,"PREDICTION"],[253,267,"PREDICTION"],[273,280,"TEAM"]]}],["I like Turkey. Their group is totally up for grabs, with Italy being the favorite—but what does that mean if the Italians didn’t even qualify for the last World Cup? Wales had a miracle run at the last Euros, but you’d be hard-pressed to find anyone willing to bet on that again. And my feelings on Switzerland’s chances are just like its historic diplomatic policy: extremely neutral. Turkey, meanwhile, has a quietly impressive squad that went on a fine run of form in the months preceding the tournament: just one loss in the last 10 matches, with a statement 4-2 win over Holland in World Cup qualifying. Key man Burak Yilmaz scored a hat trick in that game; the man is 35, yet absolutely balling out at Lille, scoring 16 goals for the team that shocked PSG to claim the Ligue 1 title. On the right side, Mehmet Zeki Celik (full back) and Yusuf Yazici (winger) were also important components of Lille’s title victory and will hope to carry that form into the national team. Turkey’s highest-profile star is probably center back Caglar Soyuncu, who’s impressed at Leicester City for the past couple seasons now. Don’t rule out the Crescent Stars!",{"entities":[[2,6,"PREDICTION"],[7,14,"TEAM"],[57,62,"TEAM"],[73,85,"PREDICTION"],[166,171,"TEAM"],[178,185,"PREDICTION"],[299,312,"TEAM"],[339,365,"PREDICTION"],[367,385,"PREDICTION"],[386,392,"TEAM"],[419,435,"PREDICTION"],[451,467,"PREDICTION"],[576,583,"TEAM"],[609,616,"PREDICTION"],[617,629,"PLAYER"],[630,648,"PREDICTION"],[723,731,"PREDICTION"],[809,826,"PLAYER"],[843,855,"PLAYER"],[875,895,"PREDICTION"],[907,920,"PREDICTION"],[978,986,"TEAM"],[987,1007,"PREDICTION"],[1032,1046,"PLAYER"],[1054,1063,"PREDICTION"]]}],["Finland. Every tournament has an unfancied team with just enough firepower and nous to get out of the group, so I am rooting for Teemu Pukki and Co.",{"entities":[[0,8,"TEAM"],[33,47,"PLAYER"],[58,74,"PLAYER"],[117,128,"PREDICTION"],[129,140,"TEAM"],[145,147,"TEAM"]]}],["Jude Bellingham, England. Jordan Henderson is washed. Let the kid cook.",{"entities":[[0,15,"PLAYER"],[17,25,"TEAM"],[26,42,"PLAYER"],[43,53,"PREDICTION"]]}],["Even though I think his team is a little overhyped, I’m really excited to see what Phil Foden does for England. They have a lot of young players who get a ton of hype (Jadon Sancho, Mason Mount, Declan Rice, and Bellingham, to name a few) but I think Foden is head and shoulders above the rest.",{"entities":[[56,70,"PREDICTION"],[83,93,"PLAYER"],[103,111,"TEAM"],[155,166,"PREDICTION"],[168,180,"PLAYER"],[182,193,"PLAYER"],[195,206,"PLAYER"],[212,222,"PLAYER"],[251,256,"PLAYER"],[257,264,"PREDICTION"],[279,293,"PREDICTION"]]}],["Has made it less likely that a young player will emerge from nowhere in an international tournament and become a star. A player like Pedri, Phil Foden, or Jadon Sancho is already playing significant roles for huge clubs, and a major tournament will not be their star turn. However, I do think it’s possible we see a player like Sweden’s Alexander Isak break onto the world stage by banging in a few goals.",{"entities":[[133,138,"PLAYER"],[140,150,"PLAYER"],[155,167,"PLAYER"],[179,204,"PREDICTION"],[262,272,"PREDICTION"],[328,336,"TEAM"],[337,351,"PLAYER"],[393,405,"PREDICTION"]]}],["João Félix, Portugal. Sublimely skilled speedster who will be playing with the hand brake off.",{"entities":[[0,10,"PLAYER"],[12,21,"TEAM"],[32,49,"PREDICTION"]]}],["Holland. Frank de Boer has no idea what he’s doing, does he? Granted they’ll get out of their group, because it has the likes of North Macedonia in it.",{"entities":[[0,8,"TEAM"],[9,22,"PLAYER"],[27,50,"PREDICTION"],[77,99,"PREDICTION"],[129,144,"TEAM"]]}],["Timo Werner in prime scoring position.",{"entities":[[0,11,"PLAYER"],[15,28,"PREDICTION"]]}],["I think Memphis Depay puts five past North Macedonia and the Dutch stay in the tournament just long enough for him to hold off anyone who goes deeper.",{"entities":[[8,21,"PLAYER"],[37,52,"TEAM"],[61,66,"TEAM"]]}],["Give me Romelu Lukaku. He’s in the form of his life right now. Belgium is clearly the best team in its group, so Lukaku should be able to rack up some goals there.",{"entities":[[0,7,"PREDICTION"],[8,22,"PLAYER"],[63,70,"TEAM"],[82,95,"TEAM"],[113,119,"PLAYER"],[146,156,"PREDICTION"]]}],["Karim Benzema, if France makes a deep run. . Also, he’s surrounded by Kevin De Bruyne (if he’s healthy) and Eden Hazard. The Belgium squad is easily good enough to go deep into the tournament, and hence provide Lukaku with more games to score in.",{"entities":[[0,13,"PLAYER"],[18,24,"TEAM"],[33,42,"PREDICTION"],[70,85,"PLAYER"],[90,102,"PREDICTION"],[108,120,"PLAYER"],[125,132,"TEAM"],[142,160,"PREDICTION"],[211,217,"PLAYER"]]}],["Gareth Bale is obviously the main man in Wales, while the postponed tournament has allowed Joe Allen to return to fitness and Aaron Ramsey is back in the fold, but how far can that squad really go this time? Unfortunately, probably not far.",{"entities":[[0,11,"PLAYER"],[29,37,"PREDICTION"],[41,46,"TEAM"],[91,100,"PLAYER"],[114,121,"PREDICTION"],[126,138,"PLAYER"],[208,239,"PREDICTION"]]}],["Hakan Calhanoglu is the main player for Turkey, but keep an eye out for Lille star Zeki Celik who led his team to the Ligue 1 title ahead of star-studded PSG this term.",{"entities":[[0,16,"PLAYER"],[24,35,"PREDICTION"],[40,46,"TEAM"],[52,71,"PREDICTION"],[72,77,"TEAM"],[78,82,"PREDICTION"],[83,93,"PLAYER"],[98,101,"PREDICTION"],[132,140,"PREDICTION"]]}],["Virgil van Dijk is missing for the Netherlands but, fortunately for them, they have landed in arguably the most favourable group and should top it with relative comfort.",{"entities":[[0,15,"PLAYER"],[16,26,"PREDICTION"],[35,46,"TEAM"],[103,122,"PREDICTION"]]}],["North Macedonia did defeat Germany in March, but they remain the lowest-ranked team in the tournament for a reason, while Austria have fallen away in the last few years after a decent streak.",{"entities":[[0,15,"TEAM"],[20,26,"PREDICTION"],[27,34,"TEAM"],[65,83,"PREDICTION"],[122,129,"TEAM"],[135,146,"TEAM"]]}],["Ukraine won their qualifying group ahead of Portugal following remarkable form under the guidance of the legendary Andriy Shevchenko, though recently results haven’t all gone their way.",{"entities":[[0,7,"TEAM"],[8,34,"PREDICTION"],[44,52,"TEAM"],[63,78,"PREDICTION"],[105,114,"PREDICTION"],[115,132,"PLAYER"],[158,185,"PREDICTION"]]}],["Croatia boast a talented squad, with pedigree of defeating England in the 2018 World Cup semi-finals, though the likes of Luka Modric aren’t getting any younger.",{"entities":[[0,7,"TEAM"],[16,30,"PREDICTION"],[49,58,"PREDICTION"],[59,66,"PLAYER"],[122,133,"PLAYER"]]}],["Czech Republic could be dark horses in Group D. They held Belgium to a draw in March and boast Premier League pedigree in the shape of West Ham duo Vladimir Coufal and Tomas Soucek as well as continental stars Patrick Schick and Jakub Jankto.",{"entities":[[0,14,"TEAM"],[24,35,"PREDICTION"],[58,65,"TEAM"],[148,163,"PLAYER"],[168,180,"PLAYER"],[192,209,"PREDICTION"],[210,224,"PLAYER"],[229,241,"PLAYER"]]}],["Scotland are very much a wildcard team who couldn’t be more up for the clash with England at Wembley. They boast a number of Premier League stars and clearly have a confident mentality under Steve Clarke.",{"entities":[[0,8,"TEAM"],[25,38,"PREDICTION"],[43,76,"PREDICTION"],[82,89,"TEAM"]]}],["Portugal won the tournament last time around without boasting the strongest squad, but here they have Bruno Fernandes, Bernardo Silva, Ruben Dias, Ruben Neves, Ricardo Pereira and Joao Cancelo all involved. Remarkably, none of that list played in 2016. They are serious contenders for the crown.",{"entities":[[0,8,"TEAM"],[9,27,"PREDICTION"],[66,81,"PREDICTION"],[102,117,"PLAYER"],[119,133,"PLAYER"],[135,145,"PLAYER"],[147,158,"PLAYER"],[160,175,"PLAYER"],[180,192,"PLAYER"],[207,217,"PREDICTION"],[262,294,"PREDICTION"]]}],["Cristiano Ronaldo will be top scorer for this tournament.",{"entities":[[0,17,"PLAYER"],[26,36,"PREDICTION"]]}]]}